tap "homebrew/bundle"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Bash scripts that integrate bat with various command-line tools
brew "bat-extras"
# Tool for managing dock items
brew "dockutil"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Clone of ls with colorful output, file type icons, and more
brew "lsd"
# Mac App Store command-line interface
brew "mas"
# Node version management
brew "n"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Cross-shell prompt for astronauts
brew "starship"
# Terminal multiplexer
brew "tmux"
# CLI tool that moves files or folder to the trash
brew "trash"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Web browser focusing on privacy
cask "brave-browser"
cask "font-code-new-roman-nerd-font"
cask "font-cousine-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-fira-mono-nerd-font"
cask "font-hack-nerd-font"
cask "font-inconsolata-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-mononoki-nerd-font"
cask "font-roboto-mono-nerd-font"
cask "font-sauce-code-pro-nerd-font"
# Terminal emulator that uses platform-native UI and GPU acceleration
cask "ghostty"
# Knowledge base that works on top of a local folder of plain text Markdown files
cask "obsidian"
# Music streaming service
cask "spotify"
# Open-source code editor
cask "visual-studio-code"
# Rust-based terminal
cask "warp"
# Native desktop client for WhatsApp
cask "whatsapp"
# Collect, organise, cite, and share research sources
cask "zotero"
mas "The Unarchiver", id: 425424353
vscode "asvetliakov.vscode-neovim"
vscode "esbenp.prettier-vscode"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "ionutvmi.path-autocomplete"
vscode "mechatroner.rainbow-csv"
vscode "ms-python.python"
vscode "teabyii.ayu"
vscode "tomoki1207.pdf"
